<?php

namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Category;

class CategorySeeder extends Seeder
{
    public function run()
    {
        $categories = [
            'خضروات طازجة',
            'فواكه طازجة',
            'معلبات وزيت وزعتر',
            'مخبوزات وأجبان',
            'منتجات منزلية',
            'ملابس رجالية',
            'ملابس نسائية',
            'ملابس أطفال',
            'أحذية وحقائب',
            'هواتف وإلكترونيات',
            'لابتوبات وأجهزة مكتبية',
            'ألعاب أطفال',
            'أدوات مدرسية وقرطاسية',
            'مستحضرات تجميل وعناية شخصية',
            'عطور وهدايا',
            'منتجات يدوية ومحلية',
            'منتجات تطريز فلسطيني',
            'كتب وروايات',
            'مستلزمات رياضية',
            'مستلزمات سيارات وأدوات',
            'أدوات كهربائية وأجهزة منزلية',
            'أثاث وديكور منزلي',
            'منتجات صحية وعلاجية',
            'منتجات غذائية عضوية',
            'منتجات حيوانات أليفة',
            'منتجات زراعية',
            'منتجات موسمية (عيد، رمضان، الخ)',

        ];

        foreach ($categories as $name) {
            Category::create(['name' => $name]);
        }
    }
}
